"IFPkgFlagIsRequired" = "The package is a required component for the installation.";

"IFPkgFlagRootVolumeOnly" = "The installation destination is limited to the boot volume.";

"IFPkgFlagOverwritePermissions" = "The permissions of directories in the installation overwrites the ones of the corresponding directories if they already exist in the destination volume.";

"IFPkgFlagUpdateInstalledLanguages" = "The installation only updates the localizations already installed.";

"IFPkgFlagRelocatable" = "The user can choose the installation destination.";

"IFPkgFlagInstallFat" = "The installation installs all the binaries for multiple platforms.";

"IFPkgFlagAllowBackRev" = "The installer shall allow to install this package even if a later version is already installed.";

"IFPkgFlagFollowLinks" = "The installation does not replace symbolic links but resolves them and continues the installation from the resolved links.";